series_pattern = "(локер|оптим|широкий прайм|прайм|экспресс|эста)"

wardrobe_type_pattern = "(2 х дверный|2 дверный|3 х дверный|3 дверный)"

case_color_pattern = "(белый снег|снег|бетон|венге|серый диамант|диамант|" \
                     "кашемир|крафт табачный|крафт|дуб табачный|дуб сонома|сонома|" \
                     "ясень анкор светлый|ясень анкор|анкор|ясень шимо светлый" \
                     "|ясень шимо|шимо)"

profile_clr_pattern = "(серебро|черный профиль|чёрный матовый|белый профиль|" \
                      "бронза профиль)"

front_type_pattern = "(волны|калейдоскоп|каледоскоп|квадраты|ленты|ромбы|шары|" \
                     "шелк|1001|1002|1003|1004|1005|1006|1007|1008|1010|1011|1015|1016|1017|1018|1019|1020|1022|" \
                     "1023|1024|1025|1026|london|лондон|orhid|орхидея|paris|париж|sakura|сакура|street|улица)"

skip_words = ["интерьер", "interior"]

wardrobe_type_matchings = {
    "2 х дверный": "2-х дверный",
    "2 дверный": "2-х дверный",
    "3 х дверный": "3-х дверный",
    "3 дверный": "3-х дверный",
}

color_matchings = {
    "анкор": "Ясень Анкор светлый",
    "белый снег": "Белый снег",
    "бетон": "Бетон",
    "венге": "Венге",
    "диамант": "Серый диамант",
    "дуб сонома": "Сонома",
    "крафт": "Крафт табачный",
    "крафт табачный": "Крафт табачный",
    "серый диамант": "Серый диамант",
    "сонома": "Сонома",
    "снег": "Белый снег",
    "кашемир": "Кашемир",
    "ясень анкор": "Ясень Анкор светлый",
    "ясень анкор светлый": "Ясень Анкор светлый",
    "ясень шимо": "Ясень Шимо светлый",
    "ясень шимо светлый": "Ясень Шимо светлый"
}

front_types_matchings = {
    "1001": "Абстракция серая",
    "1002": "Абстракция фиолетовая",
    "1003": "Листья золото",
    "1004": "Джунгли темные",
    "1005": "Абстракция розовая",
    "1006": "Абстракция оранжево-голубая",
    "1007": "Ночной мост",
    "1008": "Ночная магистраль",
    "1010": "Абстракция бело-голубая",
    "1011": "Фиолетовый дым",
    "1015": "Морские волны",
    "1016": "Абстракция золотая пыль",
    "1017": "Буквы",
    "1018": "Абстракция фиолетово-золотая",
    "1019": "Абстракция волны голубые",
    "1020": "Пионы",
    "1022": "Улица",
    "1023": "Сакура",
    "1024": "Париж",
    "1025": "Орхидея белая",
    "1026": "Ночной Лондон",
    "london": "Ночной Лондон",
    "лондон": "Ночной Лондон",
    "orhid": "Орхидея белая",
    "орхидея": "Орхидея белая",
    "paris": "Париж",
    "париж": "Париж",
    "sakura": "Сакура",
    "сакура": "Сакура",
    "street": "Улица",
    "б стекло х3": "Белое стекло",
    "б стекло зеркало б стекло": "Белое стекло, Зеркало",
    "б стекло лдсп б стекло": "Белое стекло, ЛДСП",
    "б стекло ч стекло б стекло": "Белое стекло, Черное стекло",
    "белое стекло белое стекло": "Белое стекло",
    "белое стекло зеркало": "Белое стекло, Зеркало",
    "белое стекло лдсп": "Белое стекло, ЛДСП",
    "белое стекло черное стекло": "Белое стекло, Черное стекло",
    "волны": "Шелк",
    "зеркало 3х": "Зеркало",
    "зеркало х3": "Зеркало",
    "зеркало б стекло зеркало": "Зеркало, Белое стекло",
    "зеркало белое стекло": "Зеркало, Белое стекло",
    "зеркало зеркало": "Зеркало",
    "зеркало лдсп": "Зеркало, ЛДСП",
    "зеркало лдсп зеркало": "Зеркало, ЛДСП",
    "зеркало стекло белое": "Зеркало, Белое стекло",
    "зеркало ч стекло зеркало": "Зеркало, Черное стекло",
    "зеркало черное стекло": "Зеркало, Черное стекло",
    "стекло белое белое стекло": "Белое стекло",
    "каледоскоп": "Калейдоскоп",
    "калейдоскоп": "Калейдоскоп",
    "квадраты": "Квадраты",
    "лдсп х3": "ЛДСП",
    "лдспх3": "ЛДСП",
    "лдсп б стекло лдсп": "ЛДСП, Белое стекло",
    "лдсп белое стекло": "ЛДСП, Белое стекло",
    "лдсп зеркало": "ЛДСП, Зеркало",
    "лдсп зеркало лдсп": "ЛДСП, Зеркало",
    "лдсп лдсп": "ЛДСП",
    "лдсп стекло белое": "ЛДСП, Белое стекло",
    "лдсп ч стекло лдсп": "ЛДСП, Черное стекло",
    "лдсп черное стекло": "ЛДСП, Черное стекло",
    "ленты": "Ленты",
    "ромбы": "Калейдоскоп",
    "улица": "Улица",
    "ч стеклох3": "Черное стекло",
    "ч стекло х3": "Черное стекло",
    "ч стекло б стекло чстекло": "Черное стекло, Белое стекло",
    "ч стекло б стекло ч стекло": "Черное стекло, Белое стекло",
    "ч стекло зеркало ч стекло": "Черное стекло, Зеркало",
    "ч стекло лдсп ч стекло": "Черное стекло, ЛДСП",
    "черное стекло зеркало": "Черное стекло, Зеркало",
    "черное стекло белое стекло": "Черное стекло, Белое стекло",
    "черное стекло лдсп": "Черное стекло, ЛДСП",
    "черное стекло черное стекло": "Черное стекло",
    "шары": "Шары",
    "шелк": "Шелк",
}