series = [
            "",
            "Локер",
            "Оптим",
            "Прайм",
            "Прайм Широкий",
            "Экспресс",
            "Эста"
]
caseColors = [
            "",
            "Белый снег",
            "Бетон",
            "Венге",
            "Кашемир",
            "Крафт табачный",
            "Серый диамант",
            "Сонома",
            "Ясень Анкор светлый",
            "Ясень Шимо светлый"
]
types = [
            "",
            "2-х дверный",
            "3-х дверный"
]